# 3. Існує ліст з різними даними, наприклад lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0,
# 'Lorem Ipsum']. Напишіть код, який сформує новий list (наприклад lst2), який би містив всі числові змінні (int,
# float), які є в lst1. Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від запуску до запуску.


lst1 = ['1', 1.1, '2.2', '2', 3, True, 'rf.23', '2.fdf.d23', 'False', 5, '6', .7, 8, 'Python', None, 9., 0, 'Lorem Ipsum']

lst2 = []
for elem in lst1:
    if type(elem) in {float, int}:
        lst2.append(elem)

print(f'Ось Ваш новий список об\'єктів, що мають типи int або float: \n {lst2}')
